In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [17]:
name ={1:'hadeel', 2:'maha', 3:'sara'}
s= pd.Series(name)
s

1    hadeel
2      maha
3      sara
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [18]:
s.index=[11,12,13]
s

11    hadeel
12      maha
13      sara
dtype: object

## Q3: Retrieve First and second elements.

In [19]:
s.head(2)

11    hadeel
12      maha
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [21]:
s2=pd.Series({14:'hadeel',15:'noura'})

In [23]:
d= pd.concat([s,s2])
d

11    hadeel
12      maha
13      sara
14    hadeel
15     noura
dtype: object

In [24]:
d.drop_duplicates()

11    hadeel
12      maha
13      sara
15     noura
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [26]:
data=pd.DataFrame(columns=['ID', 'Name'])
data

Empty DataFrame
Columns: [ID, Name]
Index: []

## Q6: Read educ_figdp_1_Data.csv file

In [29]:
data1= pd.read_csv('educ_figdp_1_Data.csv')
data1

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [31]:
data1[2:12]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e

In [38]:
data1.loc[90:94,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [39]:
data1.loc[9:12,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s

In [40]:
data1.loc[90:94,['TIME','GEO']]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium